Кафе/src/Documents/ТабельУчетаРабочегоВремени/ТабельУчетаРабочегоВремени.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ТабельУчетаРабочегоВремени</name>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>День</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Табель</name>
    <attributes>
      <name>ФИО</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Ставка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>День</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>День1</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>День2</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>День3</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>День4</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>День5</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>День6</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>День7</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>День8</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>День9</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>День10</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>День11</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>День12</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>День13</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>День14</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>День15</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>День16</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИтогоПолмесяца</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>День17</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>День18</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>День19</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>День20</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>День21</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>День22</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>День23</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>День24</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>День25</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>День26</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>День27</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>День28</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>День29</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>День30</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИтогоВтораяПоловина</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Кафе/src/Documents/ТабельУчетаРабочегоВремени/Forms/ФормаДокументаТабель/Module.bsl
&НаКлиенте
Процедура ОтветственныйПриИзменении(Элемент)
         Объект.Должность=ПолучитьДолжность();
КонецПроцедуры

&НаСервере
Функция ПолучитьДолжность()
	Возврат Объект.Ответственный.Должность;
КонецФункции   

&НаКлиенте
Процедура ТабельФИОПриИзменении(Элемент)
	Строчка=Элементы.Табель.ТекущиеДанные;  
    Строчка.Должность=Получить(Строчка.ФИО);
	Строчка.Ставка=ПолучитьСтавку(Строчка.ФИО);
КонецПроцедуры

&НаСервереБезКонтекста
Функция Получить(ФИО)
Возврат ФИО.Должность;  
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСтавку(Должность)
	Возврат Должность.Ставка;
КонецФункции



&НаКлиенте
Процедура ТабельДень14ПриИзменении(Элемент)
			Строчка=Элементы.Табель.ТекущиеДанные;   
Кол=0;
Если Строчка.День=Истина Тогда
	Кол=Кол+1;
КонецЕсли;

Если Строчка.День1=Истина Тогда
	Кол=Кол+1;
КонецЕсли;

Если Строчка.День2=Истина Тогда
	Кол=Кол+1;
КонецЕсли;

Если Строчка.День3=Истина Тогда
	Кол=Кол+1;
КонецЕсли;

Если Строчка.День4=Истина Тогда
	Кол=Кол+1;
КонецЕсли;

Если Строчка.День5=Истина Тогда
	Кол=Кол+1;
КонецЕсли;

Если Строчка.День6=Истина Тогда
	Кол=Кол+1;
КонецЕсли;

Если Строчка.День7=Истина Тогда
	Кол=Кол+1;
КонецЕсли;

Если Строчка.День8=Истина Тогда
	Кол=Кол+1;
КонецЕсли;

Если Строчка.День9=Истина Тогда
	Кол=Кол+1;
КонецЕсли;

Если Строчка.День10=Истина Тогда
	Кол=Кол+1;
КонецЕсли;

Если Строчка.День11=Истина Тогда
	Кол=Кол+1;
КонецЕсли;

Если Строчка.День12=Истина Тогда
	Кол=Кол+1;
КонецЕсли;

Если Строчка.День13=Истина Тогда
	Кол=Кол+1;
КонецЕсли;

Если Строчка.День14=Истина Тогда
	Кол=Кол+1;
КонецЕсли;


Строчка.ИтогоПолмесяца=Кол;
КонецПроцедуры

&НаКлиенте
Процедура ТабельДень15ПриИзменении(Элемент)
			Строчка=Элементы.Табель.ТекущиеДанные;   
Кол=0;    

Если Строчка.День15=Истина Тогда
	Кол=Кол+1;
КонецЕсли;

Если Строчка.День16=Истина Тогда
	Кол=Кол+1;
КонецЕсли;


Если Строчка.День17=Истина Тогда
	Кол=Кол+1;
КонецЕсли;

Если Строчка.День18=Истина Тогда
	Кол=Кол+1;
КонецЕсли;

Если Строчка.День19=Истина Тогда
	Кол=Кол+1;
КонецЕсли;

Если Строчка.День20=Истина Тогда
	Кол=Кол+1;
КонецЕсли;

Если Строчка.День21=Истина Тогда
	Кол=Кол+1;
КонецЕсли;

Если Строчка.День22=Истина Тогда
	Кол=Кол+1;
КонецЕсли;

Если Строчка.День23=Истина Тогда
	Кол=Кол+1;
КонецЕсли;

Если Строчка.День24=Истина Тогда
	Кол=Кол+1;
КонецЕсли;

Если Строчка.День25=Истина Тогда
	Кол=Кол+1;
КонецЕсли;

Если Строчка.День26=Истина Тогда
	Кол=Кол+1;
КонецЕсли;

Если Строчка.День27=Истина Тогда
	Кол=Кол+1;
КонецЕсли;

Если Строчка.День28=Истина Тогда
	Кол=Кол+1;
КонецЕсли;

Если Строчка.День29=Истина Тогда
	Кол=Кол+1;
КонецЕсли;

Если Строчка.День30=Истина Тогда
	Кол=Кол+1;
КонецЕсли;

Строчка.ИтогоВтораяПоловина=Кол;
КонецПроцедуры
